OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1773.c
/*
 * This definitions of the PIC16LF1773 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:15 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#include <pic16lf1773.h>

//==============================================================================

__at(0x0000) __sfr INDF0;

__at(0x0001) __sfr INDF1;

__at(0x0002) __sfr PCL;

__at(0x0003) __sfr STATUS;
__at(0x0003) volatile __STATUSbits_t STATUSbits;

__at(0x0004) __sfr FSR0;

__at(0x0004) __sfr FSR0L;

__at(0x0005) __sfr FSR0H;

__at(0x0006) __sfr FSR1;

__at(0x0006) __sfr FSR1L;

__at(0x0007) __sfr FSR1H;

__at(0x0008) __sfr BSR;
__at(0x0008) volatile __BSRbits_t BSRbits;

__at(0x0009) __sfr WREG;

__at(0x000A) __sfr PCLATH;

__at(0x000B) __sfr INTCON;
__at(0x000B) volatile __INTCONbits_t INTCONbits;

__at(0x000C) __sfr PORTA;
__at(0x000C) volatile __PORTAbits_t PORTAbits;

__at(0x000D) __sfr PORTB;
__at(0x000D) volatile __PORTBbits_t PORTBbits;

__at(0x000E) __sfr PORTC;
__at(0x000E) volatile __PORTCbits_t PORTCbits;

__at(0x0010) __sfr PORTE;
__at(0x0010) volatile __PORTEbits_t PORTEbits;

__at(0x0011) __sfr PIR1;
__at(0x0011) volatile __PIR1bits_t PIR1bits;

__at(0x0012) __sfr PIR2;
__at(0x0012) volatile __PIR2bits_t PIR2bits;

__at(0x0013) __sfr PIR3;
__at(0x0013) volatile __PIR3bits_t PIR3bits;

__at(0x0014) __sfr PIR4;
__at(0x0014) volatile __PIR4bits_t PIR4bits;

__at(0x0015) __sfr PIR5;
__at(0x0015) volatile __PIR5bits_t PIR5bits;

__at(0x0016) __sfr PIR6;
__at(0x0016) volatile __PIR6bits_t PIR6bits;

__at(0x0017) __sfr TMR0;

__at(0x0018) __sfr TMR1;

__at(0x0018) __sfr TMR1L;

__at(0x0019) __sfr TMR1H;

__at(0x001A) __sfr T1CON;
__at(0x001A) volatile __T1CONbits_t T1CONbits;

__at(0x001B) __sfr T1GCON;
__at(0x001B) volatile __T1GCONbits_t T1GCONbits;

__at(0x001C) __sfr TMR3;

__at(0x001C) __sfr TMR3L;

__at(0x001D) __sfr TMR3H;

__at(0x001E) __sfr T3CON;
__at(0x001E) volatile __T3CONbits_t T3CONbits;

__at(0x001F) __sfr T3GCON;
__at(0x001F) volatile __T3GCONbits_t T3GCONbits;

__at(0x008C) __sfr TRISA;
__at(0x008C) volatile __TRISAbits_t TRISAbits;

__at(0x008D) __sfr TRISB;
__at(0x008D) volatile __TRISBbits_t TRISBbits;

__at(0x008E) __sfr TRISC;
__at(0x008E) volatile __TRISCbits_t TRISCbits;

__at(0x0090) __sfr TRISE;
__at(0x0090) volatile __TRISEbits_t TRISEbits;

__at(0x0091) __sfr PIE1;
__at(0x0091) volatile __PIE1bits_t PIE1bits;

__at(0x0092) __sfr PIE2;
__at(0x0092) volatile __PIE2bits_t PIE2bits;

__at(0x0093) __sfr PIE3;
__at(0x0093) volatile __PIE3bits_t PIE3bits;

__at(0x0094) __sfr PIE4;
__at(0x0094) volatile __PIE4bits_t PIE4bits;

__at(0x0095) __sfr PIE5;
__at(0x0095) volatile __PIE5bits_t PIE5bits;

__at(0x0096) __sfr PIE6;
__at(0x0096) volatile __PIE6bits_t PIE6bits;

__at(0x0097) __sfr OPTION_REG;
__at(0x0097) volatile __OPTION_REGbits_t OPTION_REGbits;

__at(0x0098) __sfr PCON;
__at(0x0098) volatile __PCONbits_t PCONbits;

__at(0x0099) __sfr WDTCON;
__at(0x0099) volatile __WDTCONbits_t WDTCONbits;

__at(0x009A) __sfr OSCTUNE;
__at(0x009A) volatile __OSCTUNEbits_t OSCTUNEbits;

__at(0x009B) __sfr OSCCON;
__at(0x009B) volatile __OSCCONbits_t OSCCONbits;

__at(0x009C) __sfr OSCSTAT;
__at(0x009C) volatile __OSCSTATbits_t OSCSTATbits;

__at(0x009D) __sfr BORCON;
__at(0x009D) volatile __BORCONbits_t BORCONbits;

__at(0x009E) __sfr FVRCON;
__at(0x009E) volatile __FVRCONbits_t FVRCONbits;

__at(0x009F) __sfr ZCD1CON;
__at(0x009F) volatile __ZCD1CONbits_t ZCD1CONbits;

__at(0x010C) __sfr LATA;
__at(0x010C) volatile __LATAbits_t LATAbits;

__at(0x010D) __sfr LATB;
__at(0x010D) volatile __LATBbits_t LATBbits;

__at(0x010E) __sfr LATC;
__at(0x010E) volatile __LATCbits_t LATCbits;

__at(0x0111) __sfr CMOUT;
__at(0x0111) volatile __CMOUTbits_t CMOUTbits;

__at(0x0112) __sfr CM1CON0;
__at(0x0112) volatile __CM1CON0bits_t CM1CON0bits;

__at(0x0113) __sfr CM1CON1;
__at(0x0113) volatile __CM1CON1bits_t CM1CON1bits;

__at(0x0114) __sfr CM1NSEL;
__at(0x0114) volatile __CM1NSELbits_t CM1NSELbits;

__at(0x0115) __sfr CM1PSEL;
__at(0x0115) volatile __CM1PSELbits_t CM1PSELbits;

__at(0x0116) __sfr CM2CON0;
__at(0x0116) volatile __CM2CON0bits_t CM2CON0bits;

__at(0x0117) __sfr CM2CON1;
__at(0x0117) volatile __CM2CON1bits_t CM2CON1bits;

__at(0x0118) __sfr CM2NSEL;
__at(0x0118) volatile __CM2NSELbits_t CM2NSELbits;

__at(0x0119) __sfr CM2PSEL;
__at(0x0119) volatile __CM2PSELbits_t CM2PSELbits;

__at(0x011A) __sfr CM3CON0;
__at(0x011A) volatile __CM3CON0bits_t CM3CON0bits;

__at(0x011B) __sfr CM3CON1;
__at(0x011B) volatile __CM3CON1bits_t CM3CON1bits;

__at(0x011C) __sfr CM3NSEL;
__at(0x011C) volatile __CM3NSELbits_t CM3NSELbits;

__at(0x011D) __sfr CM3PSEL;
__at(0x011D) volatile __CM3PSELbits_t CM3PSELbits;

__at(0x018C) __sfr ANSELA;
__at(0x018C) volatile __ANSELAbits_t ANSELAbits;

__at(0x018D) __sfr ANSELB;
__at(0x018D) volatile __ANSELBbits_t ANSELBbits;

__at(0x018E) __sfr ANSELC;
__at(0x018E) volatile __ANSELCbits_t ANSELCbits;

__at(0x0191) __sfr PMADR;

__at(0x0191) __sfr PMADRL;

__at(0x0192) __sfr PMADRH;

__at(0x0193) __sfr PMDAT;

__at(0x0193) __sfr PMDATL;

__at(0x0194) __sfr PMDATH;

__at(0x0195) __sfr PMCON1;
__at(0x0195) volatile __PMCON1bits_t PMCON1bits;

__at(0x0196) __sfr PMCON2;

__at(0x0199) __sfr RC1REG;

