OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1773.c
__at(0x0694) __sfr COG1CON1;
__at(0x0694) volatile __COG1CON1bits_t COG1CON1bits;

__at(0x0695) __sfr COG1RIS0;
__at(0x0695) volatile __COG1RIS0bits_t COG1RIS0bits;

__at(0x0696) __sfr COG1RIS1;
__at(0x0696) volatile __COG1RIS1bits_t COG1RIS1bits;

__at(0x0697) __sfr COG1RSIM0;
__at(0x0697) volatile __COG1RSIM0bits_t COG1RSIM0bits;

__at(0x0698) __sfr COG1RSIM1;
__at(0x0698) volatile __COG1RSIM1bits_t COG1RSIM1bits;

__at(0x0699) __sfr COG1FIS0;
__at(0x0699) volatile __COG1FIS0bits_t COG1FIS0bits;

__at(0x069A) __sfr COG1FIS1;
__at(0x069A) volatile __COG1FIS1bits_t COG1FIS1bits;

__at(0x069B) __sfr COG1FSIM0;
__at(0x069B) volatile __COG1FSIM0bits_t COG1FSIM0bits;

__at(0x069C) __sfr COG1FSIM1;
__at(0x069C) volatile __COG1FSIM1bits_t COG1FSIM1bits;

__at(0x069D) __sfr COG1ASD0;
__at(0x069D) volatile __COG1ASD0bits_t COG1ASD0bits;

__at(0x069E) __sfr COG1ASD1;
__at(0x069E) volatile __COG1ASD1bits_t COG1ASD1bits;

__at(0x069F) __sfr COG1STR;
__at(0x069F) volatile __COG1STRbits_t COG1STRbits;

__at(0x070D) __sfr COG2PHR;
__at(0x070D) volatile __COG2PHRbits_t COG2PHRbits;

__at(0x070E) __sfr COG2PHF;
__at(0x070E) volatile __COG2PHFbits_t COG2PHFbits;

__at(0x070F) __sfr COG2BLKR;
__at(0x070F) volatile __COG2BLKRbits_t COG2BLKRbits;

__at(0x0710) __sfr COG2BLKF;
__at(0x0710) volatile __COG2BLKFbits_t COG2BLKFbits;

__at(0x0711) __sfr COG2DBR;
__at(0x0711) volatile __COG2DBRbits_t COG2DBRbits;

__at(0x0712) __sfr COG2DBF;
__at(0x0712) volatile __COG2DBFbits_t COG2DBFbits;

__at(0x0713) __sfr COG2CON0;
__at(0x0713) volatile __COG2CON0bits_t COG2CON0bits;

__at(0x0714) __sfr COG2CON1;
__at(0x0714) volatile __COG2CON1bits_t COG2CON1bits;

__at(0x0715) __sfr COG2RIS0;
__at(0x0715) volatile __COG2RIS0bits_t COG2RIS0bits;

__at(0x0716) __sfr COG2RIS1;
__at(0x0716) volatile __COG2RIS1bits_t COG2RIS1bits;

__at(0x0717) __sfr COG2RSIM0;
__at(0x0717) volatile __COG2RSIM0bits_t COG2RSIM0bits;

__at(0x0718) __sfr COG2RSIM1;
__at(0x0718) volatile __COG2RSIM1bits_t COG2RSIM1bits;

__at(0x0719) __sfr COG2FIS0;
__at(0x0719) volatile __COG2FIS0bits_t COG2FIS0bits;

__at(0x071A) __sfr COG2FIS1;
__at(0x071A) volatile __COG2FIS1bits_t COG2FIS1bits;

__at(0x071B) __sfr COG2FSIM0;
__at(0x071B) volatile __COG2FSIM0bits_t COG2FSIM0bits;

__at(0x071C) __sfr COG2FSIM1;
__at(0x071C) volatile __COG2FSIM1bits_t COG2FSIM1bits;

__at(0x071D) __sfr COG2ASD0;
__at(0x071D) volatile __COG2ASD0bits_t COG2ASD0bits;

__at(0x071E) __sfr COG2ASD1;
__at(0x071E) volatile __COG2ASD1bits_t COG2ASD1bits;

__at(0x071F) __sfr COG2STR;
__at(0x071F) volatile __COG2STRbits_t COG2STRbits;

__at(0x078E) __sfr PRG1RTSS;
__at(0x078E) volatile __PRG1RTSSbits_t PRG1RTSSbits;

__at(0x078F) __sfr PRG1FTSS;
__at(0x078F) volatile __PRG1FTSSbits_t PRG1FTSSbits;

__at(0x0790) __sfr PRG1INS;
__at(0x0790) volatile __PRG1INSbits_t PRG1INSbits;

__at(0x0791) __sfr PRG1CON0;
__at(0x0791) volatile __PRG1CON0bits_t PRG1CON0bits;

__at(0x0792) __sfr PRG1CON1;
__at(0x0792) volatile __PRG1CON1bits_t PRG1CON1bits;

__at(0x0793) __sfr PRG1CON2;
__at(0x0793) volatile __PRG1CON2bits_t PRG1CON2bits;

__at(0x0794) __sfr PRG2RTSS;
__at(0x0794) volatile __PRG2RTSSbits_t PRG2RTSSbits;

__at(0x0795) __sfr PRG2FTSS;
__at(0x0795) volatile __PRG2FTSSbits_t PRG2FTSSbits;

__at(0x0796) __sfr PRG2INS;
__at(0x0796) volatile __PRG2INSbits_t PRG2INSbits;

__at(0x0797) __sfr PRG2CON0;
__at(0x0797) volatile __PRG2CON0bits_t PRG2CON0bits;

__at(0x0798) __sfr PRG2CON1;
__at(0x0798) volatile __PRG2CON1bits_t PRG2CON1bits;

__at(0x0799) __sfr PRG2CON2;
__at(0x0799) volatile __PRG2CON2bits_t PRG2CON2bits;

__at(0x079A) __sfr PRG3RTSS;
__at(0x079A) volatile __PRG3RTSSbits_t PRG3RTSSbits;

__at(0x079B) __sfr PRG3FTSS;
__at(0x079B) volatile __PRG3FTSSbits_t PRG3FTSSbits;

__at(0x079C) __sfr PRG3INS;
__at(0x079C) volatile __PRG3INSbits_t PRG3INSbits;

__at(0x079D) __sfr PRG3CON0;
__at(0x079D) volatile __PRG3CON0bits_t PRG3CON0bits;

__at(0x079E) __sfr PRG3CON1;
__at(0x079E) volatile __PRG3CON1bits_t PRG3CON1bits;

__at(0x079F) __sfr PRG3CON2;
__at(0x079F) volatile __PRG3CON2bits_t PRG3CON2bits;

__at(0x080D) __sfr COG3PHR;
__at(0x080D) volatile __COG3PHRbits_t COG3PHRbits;

__at(0x080E) __sfr COG3PHF;
__at(0x080E) volatile __COG3PHFbits_t COG3PHFbits;

__at(0x080F) __sfr COG3BLKR;
__at(0x080F) volatile __COG3BLKRbits_t COG3BLKRbits;

__at(0x0810) __sfr COG3BLKF;
__at(0x0810) volatile __COG3BLKFbits_t COG3BLKFbits;

__at(0x0811) __sfr COG3DBR;
__at(0x0811) volatile __COG3DBRbits_t COG3DBRbits;

__at(0x0812) __sfr COG3DBF;
__at(0x0812) volatile __COG3DBFbits_t COG3DBFbits;

__at(0x0813) __sfr COG3CON0;
__at(0x0813) volatile __COG3CON0bits_t COG3CON0bits;

__at(0x0814) __sfr COG3CON1;
__at(0x0814) volatile __COG3CON1bits_t COG3CON1bits;

__at(0x0815) __sfr COG3RIS0;
__at(0x0815) volatile __COG3RIS0bits_t COG3RIS0bits;

__at(0x0816) __sfr COG3RIS1;
__at(0x0816) volatile __COG3RIS1bits_t COG3RIS1bits;

__at(0x0817) __sfr COG3RSIM0;
__at(0x0817) volatile __COG3RSIM0bits_t COG3RSIM0bits;

__at(0x0818) __sfr COG3RSIM1;
__at(0x0818) volatile __COG3RSIM1bits_t COG3RSIM1bits;

__at(0x0819) __sfr COG3FIS0;
__at(0x0819) volatile __COG3FIS0bits_t COG3FIS0bits;

__at(0x081A) __sfr COG3FIS1;
__at(0x081A) volatile __COG3FIS1bits_t COG3FIS1bits;

__at(0x081B) __sfr COG3FSIM0;
__at(0x081B) volatile __COG3FSIM0bits_t COG3FSIM0bits;

__at(0x081C) __sfr COG3FSIM1;
__at(0x081C) volatile __COG3FSIM1bits_t COG3FSIM1bits;

__at(0x081D) __sfr COG3ASD0;
__at(0x081D) volatile __COG3ASD0bits_t COG3ASD0bits;

__at(0x081E) __sfr COG3ASD1;
__at(0x081E) volatile __COG3ASD1bits_t COG3ASD1bits;

__at(0x081F) __sfr COG3STR;
__at(0x081F) volatile __COG3STRbits_t COG3STRbits;

__at(0x090C) __sfr CM4CON0;
__at(0x090C) volatile __CM4CON0bits_t CM4CON0bits;

__at(0x090D) __sfr CM4CON1;
__at(0x090D) volatile __CM4CON1bits_t CM4CON1bits;

__at(0x090E) __sfr CM4NSEL;
__at(0x090E) volatile __CM4NSELbits_t CM4NSELbits;

__at(0x090F) __sfr CM4PSEL;
__at(0x090F) volatile __CM4PSELbits_t CM4PSELbits;

__at(0x0910) __sfr CM5CON0;
__at(0x0910) volatile __CM5CON0bits_t CM5CON0bits;

__at(0x0911) __sfr CM5CON1;
__at(0x0911) volatile __CM5CON1bits_t CM5CON1bits;

__at(0x0912) __sfr CM5NSEL;
__at(0x0912) volatile __CM5NSELbits_t CM5NSELbits;

__at(0x0913) __sfr CM5PSEL;
__at(0x0913) volatile __CM5PSELbits_t CM5PSELbits;

